//===- include/pstore/core/hamt_map_types.hpp -------------*- mode: C++ -*-===//
//*  _                     _                             _                          *
//* | |__   __ _ _ __ ___ | |_   _ __ ___   __ _ _ __   | |_ _   _ _ __   ___  ___  *
//* | '_ \ / _` | '_ ` _ \| __| | '_ ` _ \ / _` | '_ \  | __| | | | '_ \ / _ \/ __| *
//* | | | | (_| | | | | | | |_  | | | | | | (_| | |_) | | |_| |_| | |_) |  __/\__ \ *
//* |_| |_|\__,_|_| |_| |_|\__| |_| |_| |_|\__,_| .__/   \__|\__, | .__/ \___||___/ *
//*                                             |_|          |___/|_|               *
//===----------------------------------------------------------------------===//
//
// Part of the pstore project, under the Apache License v2.0 with LLVM Exceptions.
// See https://github.com/SNSystems/pstore/blob/master/LICENSE.txt for license
// information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
/// \file hamt_map_types.hpp

#ifndef PSTORE_CORE_HAMT_MAP_TYPES_HPP
#define PSTORE_CORE_HAMT_MAP_TYPES_HPP

#include "pstore/adt/chunked_sequence.hpp"
#include "pstore/core/array_stack.hpp"
#include "pstore/core/db_archive.hpp"

namespace pstore {
    class transaction_base;

    namespace index {
        namespace details {
            using hash_type = std::uint64_t;
            /// The number of bits in hash_type. This is the maximum number of children that an
            /// internal-node can carry.
            constexpr auto const hash_size = sizeof (hash_type) * 8;

#ifdef _MSC_VER
            // TODO: VC2015RC won't allow pop_count to be constexpr. Sigh. This forces a (very
            // crude) population count implementation
            namespace details_count {
                constexpr inline unsigned bit_set (std::size_t v, unsigned bit) {
                    return (v & (std::size_t{1} << bit)) >> bit;
                }

                constexpr inline unsigned crude_pop_count (std::size_t v) {
                    return bit_set (v, 0x00) + bit_set (v, 0x01) + bit_set (v, 0x02) +
                           bit_set (v, 0x03) + bit_set (v, 0x04) + bit_set (v, 0x05) +
                           bit_set (v, 0x06) + bit_set (v, 0x07) + bit_set (v, 0x08) +
                           bit_set (v, 0x09) + bit_set (v, 0x0A) + bit_set (v, 0x0B) +
                           bit_set (v, 0x0C) + bit_set (v, 0x0D) + bit_set (v, 0x0E) +
                           bit_set (v, 0x0F);
                }
            } // namespace details_count
            constexpr unsigned hash_index_bits = details_count::crude_pop_count (hash_size - 1);
#else
            /// The number of bits that it takes to represent hash_size.
            constexpr unsigned hash_index_bits = bit_count::pop_count (hash_size - 1);
#endif
            constexpr unsigned max_hash_bits = (hash_size + 7) / hash_index_bits * hash_index_bits;
            constexpr unsigned hash_index_mask = (1U << hash_index_bits) - 1U;
            constexpr unsigned max_internal_depth = max_hash_bits / hash_index_bits;

            /// The max depth of the hash trees include several levels internal nodes
            /// (max_internal_depth), one linear node and one leaf node.
            constexpr unsigned max_tree_depth = max_internal_depth + 2U;

            /// Using LSB for marking internal nodes
            constexpr std::uintptr_t internal_node_bit = 1;

            /// Using second LSB for marking newly allocated internal nodes
            constexpr std::uintptr_t heap_node_bit = 2;

        } // end namespace details

        //*  _                _           _    _         _    *
        //* | |_  ___ __ _ __| |___ _ _  | |__| |___  __| |__ *
        //* | ' \/ -_) _` / _` / -_) '_| | '_ \ / _ \/ _| / / *
        //* |_||_\___\__,_\__,_\___|_|   |_.__/_\___/\__|_\_\ *
        //*                                                   *
        /// The address of an instance of this type is passed to the hamt_map ctor to load an
        /// existing index, and it is returned by a call to hamt_map::flush().
        struct header_block {
            std::array<std::uint8_t, 8> signature;
            /// The number of keys stored in the tree.
            std::uint64_t size;
            /// The store address of the tree's root node.
            address root;
        };

        PSTORE_STATIC_ASSERT (sizeof (header_block) == 24);
        PSTORE_STATIC_ASSERT (offsetof (header_block, signature) == 0);
        PSTORE_STATIC_ASSERT (offsetof (header_block, size) == 8);
        PSTORE_STATIC_ASSERT (offsetof (header_block, root) == 16);


        namespace details {

            std::size_t const not_found = std::numeric_limits<std::size_t>::max ();

            class internal_node;
            class linear_node;

            constexpr bool depth_is_internal_node (unsigned const shift) noexcept {
                return shift < details::max_hash_bits;
            }

            struct nchildren {
                std::size_t n;
            };

            //*  _         _                     _     _            *
            //* (_)_ _  __| |_____ __  _ __  ___(_)_ _| |_ ___ _ _  *
            //* | | ' \/ _` / -_) \ / | '_ \/ _ \ | ' \  _/ -_) '_| *
            //* |_|_||_\__,_\___/_\_\ | .__/\___/_|_||_\__\___|_|   *
            //*                       |_|                           *
            /// An index pointer is either a database address or a pointer to volatile RAM.
            /// The type information (which of the two fields applies) is carried externally.
            union index_pointer {
                index_pointer () noexcept
                        : internal{nullptr} {}
                explicit index_pointer (address const a) noexcept
                        : addr (a) {}
                explicit index_pointer (typed_address<internal_node> const a) noexcept
                        : addr (a.to_address ()) {}
                explicit index_pointer (typed_address<linear_node> const a) noexcept
                        : addr (a.to_address ()) {}
                explicit index_pointer (internal_node * const p) noexcept
                        : internal{tag_node (p)} {}
                explicit index_pointer (linear_node * const p) noexcept
                        : linear{tag_node (p)} {}
                index_pointer (index_pointer const &) noexcept = default;
                index_pointer (index_pointer &&) noexcept = default;

                index_pointer & operator= (index_pointer const &) = default;
                index_pointer & operator= (index_pointer &&) noexcept = default;
                index_pointer & operator= (address const & a) noexcept {
                    addr = a;
                    return *this;
                }
                index_pointer & operator= (typed_address<internal_node> const & a) noexcept {
                    addr = a.to_address ();
                    return *this;
                }
                index_pointer & operator= (typed_address<linear_node> const & a) noexcept {
                    addr = a.to_address ();
                    return *this;
                }
                index_pointer & operator= (internal_node * const p) noexcept {
                    internal = tag_node (p);
                    return *this;
                }
                index_pointer & operator= (linear_node * const l) noexcept {
                    linear = tag_node (l);
                    return *this;
                }


                bool operator== (index_pointer const & other) const noexcept {
                    return addr == other.addr;
                }
                bool operator!= (index_pointer const & other) const noexcept {
                    return !operator== (other);
                }

                explicit operator bool () const noexcept { return !this->is_empty (); }

                /// Returns true if the index_pointer is pointing to an internal node, false
                /// otherwise.
                /// \sa is_leaf
                bool is_internal () const noexcept {
                    return (reinterpret_cast<std::uintptr_t> (internal) & internal_node_bit) != 0;
                }

                /// Returns true if the index_pointer is pointing to a linear node, false otherwise.
                /// \sa is_leaf
                /// \note A linear node is always found at max_internal_depth. This function will
                /// return true for internal nodes  at lower tree levels.
                bool is_linear () const noexcept { return is_internal (); }

                /// Returns true if the index_pointer is pointing to a value address in the store,
                /// false otherwise.
                /// \sa is_internal
                bool is_leaf () const noexcept { return !is_internal (); }

                /// Returns true if the index_pointer is pointing to a heap node, false otherwise.
                /// \sa is_addr
                bool is_heap () const noexcept {
                    return (reinterpret_cast<std::uintptr_t> (internal) & heap_node_bit) != 0;
                }

                /// Returns true if the index_pointer is pointing to a store node, false otherwise.
                /// \sa is_heap
                bool is_address () const noexcept { return !is_heap (); }

                bool is_empty () const noexcept { return internal == nullptr; }
                template <typename T>
                T tag_node () const noexcept {
                    return reinterpret_cast<T> (tag ());
                }

                template <typename T>
                T untag_node () const noexcept {
                    return reinterpret_cast<T> (untag ());
                }

                typed_address<internal_node> untag_internal_address () const noexcept {
                    return typed_address<internal_node>::make (addr.absolute () &
                                                               ~internal_node_bit);
                }
                typed_address<linear_node> untag_linear_address () const noexcept {
                    return typed_address<linear_node>::make (addr.absolute () & ~internal_node_bit);
                }

                address addr;
                internal_node * internal;
                linear_node * linear;

            private:
                static std::uintptr_t tag (void * const p) noexcept {
                    return reinterpret_cast<std::uintptr_t> (p) | internal_node_bit | heap_node_bit;
                }
                std::uintptr_t tag () const noexcept { return tag (internal); }

                static internal_node * tag_node (internal_node * const p) noexcept {
                    return reinterpret_cast<internal_node *> (tag (p));
                }
                static linear_node * tag_node (linear_node * const p) noexcept {
                    return reinterpret_cast<linear_node *> (tag (p));
                }

                std::uintptr_t untag () const noexcept {
                    return reinterpret_cast<std::uintptr_t> (internal) & ~internal_node_bit &
                           ~heap_node_bit;
                }
            };


            PSTORE_STATIC_ASSERT (sizeof (index_pointer) == 8);
            PSTORE_STATIC_ASSERT (alignof (index_pointer) == 8);
            PSTORE_STATIC_ASSERT (offsetof (index_pointer, addr) == 0);
            PSTORE_STATIC_ASSERT (sizeof (index_pointer::internal) == sizeof (index_pointer::addr));
            PSTORE_STATIC_ASSERT (offsetof (index_pointer, internal) == 0);
            PSTORE_STATIC_ASSERT (sizeof (index_pointer::linear) == sizeof (index_pointer::addr));
            PSTORE_STATIC_ASSERT (offsetof (index_pointer, linear) == 0);


            //*                         _     _                   *
            //*  _ __  __ _ _ _ ___ _ _| |_  | |_ _  _ _ __  ___  *
            //* | '_ \/ _` | '_/ -_) ' \  _| |  _| || | '_ \/ -_) *
            //* | .__/\__,_|_| \___|_||_\__|  \__|\_, | .__/\___| *
            //* |_|                               |__/|_|         *
            /// \brief A class used to keep the pointer to parent node and the child slot.
            class parent_type {
            public:
                parent_type () = default;

                /// Constructs a parent type object.
                /// \param idx  The pointer to either the parent node or a leaf node.
                /// \param pos  If idx is a leaf node address, pos is set to the default value
                ///             (not_found). Otherwise, pos refers to the child slot.
                parent_type (index_pointer const idx, std::size_t const pos = not_found) noexcept
