//*  _                     _                             _                          *
//* | |__   __ _ _ __ ___ | |_   _ __ ___   __ _ _ __   | |_ _   _ _ __   ___  ___  *
//* | '_ \ / _` | '_ ` _ \| __| | '_ ` _ \ / _` | '_ \  | __| | | | '_ \ / _ \/ __| *
//* | | | | (_| | | | | | | |_  | | | | | | (_| | |_) | | |_| |_| | |_) |  __/\__ \ *
//* |_| |_|\__,_|_| |_| |_|\__| |_| |_| |_|\__,_| .__/   \__|\__, | .__/ \___||___/ *
//*                                             |_|          |___/|_|               *
//===- include/pstore/core/hamt_map_types.hpp -----------------------------===//
// Copyright (c) 2017-2018 by Sony Interactive Entertainment, Inc.
// All rights reserved.
//
// Developed by:
//   Toolchain Team
//   SN Systems, Ltd.
//   www.snsystems.com
//
// Permission is hereby granted, free of charge, to any person obtaining a
// copy of this software and associated documentation files (the
// "Software"), to deal with the Software without restriction, including
// without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to
// permit persons to whom the Software is furnished to do so, subject to
// the following conditions:
//
// - Redistributions of source code must retain the above copyright notice,
//   this list of conditions and the following disclaimers.
//
// - Redistributions in binary form must reproduce the above copyright

#include "pstore/support/gsl.hpp"

namespace pstore {
    class transaction_base;

    namespace index {
        namespace details {
            using hash_type = std::uint64_t;

#ifdef _MSC_VER
            // TODO: VC2015RC won't allow pop_count to be constexpr. Sigh. This forces a (very
            // crude) population count implementation
            namespace details_count {
                constexpr inline unsigned bit_set (std::size_t v, unsigned bit) {
                    return (v & (std::size_t{1} << bit)) >> bit;
                }

                constexpr inline unsigned crude_pop_count (std::size_t v) {
                    return bit_set (v, 0x00) + bit_set (v, 0x01) + bit_set (v, 0x02) +
                           bit_set (v, 0x03) + bit_set (v, 0x04) + bit_set (v, 0x05) +
                           bit_set (v, 0x06) + bit_set (v, 0x07) + bit_set (v, 0x08) +
                           bit_set (v, 0x09) + bit_set (v, 0x0A) + bit_set (v, 0x0B) +
                           bit_set (v, 0x0C) + bit_set (v, 0x0D) + bit_set (v, 0x0E) +
                           bit_set (v, 0x0F);
                }
            } // namespace details_count
            constexpr unsigned hash_index_bits =
                details_count::crude_pop_count (sizeof (hash_type) * 8 - 1);
#else
            // TODO: one day the MSVC-specific code will go away and this will be all we need...
            constexpr unsigned hash_index_bits = bit_count::pop_count (sizeof (hash_type) * 8 - 1);
#endif

            constexpr auto const hash_size = sizeof (hash_type) * 8;
            constexpr auto const max_hash_bits =
                (hash_size + 7) / hash_index_bits * hash_index_bits;
            constexpr unsigned hash_index_mask = (1U << hash_index_bits) - 1U;
            constexpr unsigned max_internal_depth = max_hash_bits / hash_index_bits;

            /// The max depth of the hash trees include several levels internal nodes (max_hash_bits
            /// / hash_index_bits), one level linear node and one level leaf node.
            constexpr unsigned max_tree_depth = max_internal_depth + 2U;

            /// Using LSB for marking internal nodes
            constexpr std::uintptr_t internal_node_bit = 1;

            /// Using second LSB for marking newly allocated internal nodes
            constexpr std::uintptr_t heap_node_bit = 2;

        } // namespace details
    }     // namespace index
} // namespace pstore


namespace pstore {
    namespace index {

        using ::pstore::gsl::not_null;

        //*  _                _           _    _         _    *
        //* | |_  ___ __ _ __| |___ _ _  | |__| |___  __| |__ *
        //* | ' \/ -_) _` / _` / -_) '_| | '_ \ / _ \/ _| / / *
        //* |_||_\___\__,_\__,_\___|_|   |_.__/_\___/\__|_\_\ *
        //*                                                   *
        /// The address of an instance of this type is passed to the hamt_map ctor to load an
        /// existing index, and it is returned by a call to hamt_map::flush().
        struct header_block {
            std::array<std::uint8_t, 8> signature;
            /// The number of keys stored in the tree.
            std::uint64_t size;
            /// The store address of the tree's root node.
            address root;
        };

        PSTORE_STATIC_ASSERT (sizeof (header_block) == 24);
        PSTORE_STATIC_ASSERT (offsetof (header_block, signature) == 0);
        PSTORE_STATIC_ASSERT (offsetof (header_block, size) == 8);
        PSTORE_STATIC_ASSERT (offsetof (header_block, root) == 16);


        namespace details {

            std::size_t const not_found = std::numeric_limits<std::size_t>::max ();

            class internal_node;
            class linear_node;

            inline bool depth_is_internal_node (unsigned shift) {
                return shift < details::max_hash_bits;
            }


            //*  _         _                     _     _            *
            //* (_)_ _  __| |_____ __  _ __  ___(_)_ _| |_ ___ _ _  *
            //* | | ' \/ _` / -_) \ / | '_ \/ _ \ | ' \  _/ -_) '_| *
            //* |_|_||_\__,_\___/_\_\ | .__/\___/_|_||_\__\___|_|   *
            //*                       |_|                           *
            /// An index pointer is either a database address or a pointer to volatile RAM.
            /// The type information (which of the two fields applies) is carried externally.
            union index_pointer {
                index_pointer ()
                        : internal{nullptr} {}
                index_pointer (address const a)
                        : addr (a) {}
                index_pointer (internal_node * p)
                        : internal{tag_node (p)} {}
                index_pointer (linear_node * p)
                        : linear{tag_node (p)} {}
                index_pointer (index_pointer const &) = default;
                index_pointer (index_pointer &&) noexcept = default;

                index_pointer & operator= (index_pointer const &) = default;
                index_pointer & operator= (index_pointer &&) noexcept = default;
                index_pointer & operator= (address const & a) {
                    addr = a;
                    return *this;
                }
                index_pointer & operator= (internal_node * p) {
                    internal = tag_node (p);
                    return *this;
                }
                index_pointer & operator= (linear_node * l) {
                    linear = tag_node (l);
                    return *this;
                }


                bool operator== (index_pointer const & other) const { return addr == other.addr; }
                bool operator!= (index_pointer const & other) const { return !operator== (other); }

                operator bool () const { return !this->is_empty (); }

                /// Returns true if the index_pointer is pointing to an internal node, false
                /// otherwise.
                /// \sa is_leaf
                bool is_internal () const {
                    return (reinterpret_cast<std::uintptr_t> (internal) & internal_node_bit) != 0;
                }

                /// Returns true if the index_pointer is pointing to a linear node, false otherwise.
                /// \sa is_leaf
                bool is_linear () const { return is_internal (); }

                /// Returns true if the index_pointer is pointing to a value address in the store,
                /// false otherwise.
                /// \sa is_internal
                bool is_leaf () const { return !is_internal (); }

                /// Returns true if the index_pointer is pointing to a heap node, false otherwise.
                /// \sa is_addr
                bool is_heap () const {
                    return (reinterpret_cast<std::uintptr_t> (internal) & heap_node_bit) != 0;
                }

                /// Returns true if the index_pointer is pointing to a store node, false otherwise.
                /// \sa is_heap
                bool is_address () const { return !is_heap (); }

                bool is_empty () const { return internal == nullptr; }
                template <typename T>
                T tag_node () const {
                    return reinterpret_cast<T> (tag ());
                }

                template <typename T>
                T untag_node () const {
                    return reinterpret_cast<T> (untag ());
                }

                address untag_internal_address () const {
                    return address::make (addr.absolute () & ~internal_node_bit);
                }

                address addr;
                internal_node * internal;
                linear_node * linear;

            private:
                static std::uintptr_t tag (void * p) {
                    return reinterpret_cast<std::uintptr_t> (p) | internal_node_bit | heap_node_bit;
                }
                static inline internal_node * tag_node (internal_node * p) {
                    return reinterpret_cast<internal_node *> (tag (p));
                }
                static inline linear_node * tag_node (linear_node * p) {
                    return reinterpret_cast<linear_node *> (tag (p));
                }

                std::uintptr_t tag () const { return tag (internal); }

                std::uintptr_t untag () const {
                    return reinterpret_cast<std::uintptr_t> (internal) & ~internal_node_bit &
                           ~heap_node_bit;
                }
            };


            PSTORE_STATIC_ASSERT (sizeof (index_pointer) == 8);
            PSTORE_STATIC_ASSERT (offsetof (index_pointer, addr) == 0);
            PSTORE_STATIC_ASSERT (sizeof (index_pointer::internal) == sizeof (index_pointer::addr));
            PSTORE_STATIC_ASSERT (offsetof (index_pointer, internal) == 0);
            PSTORE_STATIC_ASSERT (sizeof (index_pointer::linear) == sizeof (index_pointer::addr));
            PSTORE_STATIC_ASSERT (offsetof (index_pointer, linear) == 0);


            //*                         _     _                   *
            //*  _ __  __ _ _ _ ___ _ _| |_  | |_ _  _ _ __  ___  *
            //* | '_ \/ _` | '_/ -_) ' \  _| |  _| || | '_ \/ -_) *
            //* | .__/\__,_|_| \___|_||_\__|  \__|\_, | .__/\___| *
            //* |_|                               |__/|_|         *
            /// \brief A class used to keep the pointer to parent node and the child slot.
            struct parent_type {
                parent_type () = default;

                /// Constructs a parent type object.
                /// \param idx  The pointer to either the parent node or a leaf node.
                /// \param pos  If idx is a leaf node address, pos is set to the default value
                ///             (not_found). Otherwise, pos refers to the child slot.
                parent_type (index_pointer const idx, std::size_t pos = not_found)
                        : node (idx)
