//*   __                                      _    *
//*  / _|_ __ __ _  __ _ _ __ ___   ___ _ __ | |_  *
//* | |_| '__/ _` |/ _` | '_ ` _ \ / _ \ '_ \| __| *
//* |  _| | | (_| | (_| | | | | | |  __/ | | | |_  *
//* |_| |_|  \__,_|\__, |_| |_| |_|\___|_| |_|\__| *
//*                |___/                           *
//===- include/pstore_mcrepo/fragment.hpp ---------------------------------===//
// Copyright (c) 2017 by Sony Interactive Entertainment, Inc.
// All rights reserved.
//
// Developed by:
//   Toolchain Team
//   SN Systems, Ltd.
//   www.snsystems.com
//
// Permission is hereby granted, free of charge, to any person obtaining a
// copy of this software and associated documentation files (the
// "Software"), to deal with the Software without restriction, including
// without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to
// permit persons to whom the Software is furnished to do so, subject to
// the following conditions:
//
// - Redistributions of source code must retain the above copyright notice,
//   this list of conditions and the following disclaimers.
//
// - Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimers in the
//   documentation and/or other materials provided with the distribution.
//
// - Neither the names of SN Systems Ltd., Sony Interactive Entertainment,
//   Inc. nor the names of its contributors may be used to endorse or
//   promote products derived from this Software without specific prior
//   written permission.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
// OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
// MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
// IN NO EVENT SHALL THE CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR
// ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
// TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
// SOFTWARE OR THE USE OR OTHER DEALINGS WITH THE SOFTWARE.
//===----------------------------------------------------------------------===//
#ifndef PSTORE_MCREPO_FRAGMENT_HPP
#define PSTORE_MCREPO_FRAGMENT_HPP

#include <algorithm>
#include <cassert>
#include <cstddef>
#include <cstdint>
#include <iterator>
#include <limits>
#include <type_traits>
#include <vector>

#include "pstore/address.hpp"
#include "pstore/file_header.hpp"
#include "pstore/transaction.hpp"
#include "pstore_mcrepo/aligned.hpp"
#include "pstore_mcrepo/sparse_array.hpp"
#include "pstore_support/small_vector.hpp"

namespace pstore {
    namespace repo {

        //*  _     _                     _    __ _                *
        //* (_)_ _| |_ ___ _ _ _ _  __ _| |  / _(_)_ ___  _ _ __  *
        //* | | ' \  _/ -_) '_| ' \/ _` | | |  _| \ \ / || | '_ \ *
        //* |_|_||_\__\___|_| |_||_\__,_|_| |_| |_/_\_\\_,_| .__/ *
        //*                                                |_|    *
        struct internal_fixup {
            std::uint8_t section;
            std::uint8_t type;
            std::uint16_t padding;
            std::uint32_t offset;
            std::uint32_t addend;
        };

        static_assert (std::is_standard_layout<internal_fixup>::value,
                       "internal_fixup must satisfy StandardLayoutType");

        static_assert (offsetof (internal_fixup, section) == 0,
                       "section offset differs from expected value");
        static_assert (offsetof (internal_fixup, type) == 1,
                       "type offset differs from expected value");
        static_assert (offsetof (internal_fixup, padding) == 2,
                       "padding offset differs from expected value");
        static_assert (offsetof (internal_fixup, offset) == 4,
                       "offset offset differs from expected value");
        static_assert (offsetof (internal_fixup, addend) == 8,
                       "addend offset differs from expected value");
        static_assert (sizeof (internal_fixup) == 12,
                       "internal_fixup size does not match expected");

        //*          _                     _    __ _                *
        //*  _____ _| |_ ___ _ _ _ _  __ _| |  / _(_)_ ___  _ _ __  *
        //* / -_) \ /  _/ -_) '_| ' \/ _` | | |  _| \ \ / || | '_ \ *
        //* \___/_\_\\__\___|_| |_||_\__,_|_| |_| |_/_\_\\_,_| .__/ *
        //*                                                  |_|    *
        struct external_fixup {
            pstore::address name;
            std::uint8_t type;
            // FIXME: much padding here.
            std::uint64_t offset;
            std::uint64_t addend;
        };

        static_assert (std::is_standard_layout<external_fixup>::value,
                       "external_fixup must satisfy StandardLayoutType");
        static_assert (offsetof (external_fixup, name) == 0,
                       "name offset differs from expected value");
        static_assert (offsetof (external_fixup, type) == 8,
                       "type offset differs from expected value");
        static_assert (offsetof (external_fixup, offset) == 16,
                       "offset offset differs from expected value");
        static_assert (offsetof (external_fixup, addend) == 24,
                       "addend offset differs from expected value");
        // static_assert (offsetof (external_fixup, padding3) == 20, "padding3 offset
        // differs from expected value");
        static_assert (sizeof (external_fixup) == 32,
                       "external_fixup size does not match expected");

        //*             _   _           *
        //*  ___ ___ __| |_(_)___ _ _   *
        //* (_-</ -_) _|  _| / _ \ ' \  *
        //* /__/\___\__|\__|_\___/_||_| *
        //*                             *
        class section {
            friend struct section_check;

        public:
            /// Describes the three members of a section as three pairs of iterators: one
            /// each for the data, internal fixups, and external fixups ranges.
            template <typename DataRangeType, typename IFixupRangeType, typename XFixupRangeType>
            struct sources {
                DataRangeType data_range;
                IFixupRangeType ifixups_range;
                XFixupRangeType xfixups_range;
            };

            template <typename DataRange, typename IFixupRange, typename XFixupRange>
            static inline auto make_sources (DataRange const & d, IFixupRange const & i,
                                             XFixupRange const & x)
                -> sources<DataRange, IFixupRange, XFixupRange> {
                return {d, i, x};
            }

            template <typename DataRange, typename IFixupRange, typename XFixupRange>
            section (DataRange const & d, IFixupRange const & i, XFixupRange const & x);

            template <typename DataRange, typename IFixupRange, typename XFixupRange>
            section (sources<DataRange, IFixupRange, XFixupRange> const & src)
                    : section (src.data_range, src.ifixups_range, src.xfixups_range) {}

            section (section const &) = delete;
            section & operator= (section const &) = delete;
            section (section &&) = delete;
            section & operator= (section &&) = delete;

            /// A simple wrapper around the elements of one of the three arrays that make
            /// up a section. Enables the use of standard algorithms as well as
            /// range-based for loops on these collections.
            template <typename ValueType>
            class container {
            public:
                using value_type = ValueType const;
                using size_type = std::size_t;
                using difference_type = std::ptrdiff_t;
                using reference = ValueType const &;
                using const_reference = reference;
                using pointer = ValueType const *;
                using const_pointer = pointer;
                using iterator = const_pointer;
                using const_iterator = iterator;

                container (const_pointer begin, const_pointer end)
                        : begin_{begin}
                        , end_{end} {
                    assert (end >= begin);
                }
                iterator begin () const {
                    return begin_;
                }
                iterator end () const {
                    return end_;
                }
                const_iterator cbegin () const {
                    return begin ();
                }
                const_iterator cend () const {
                    return end ();
                }

                size_type size () const {
                    return end_ - begin_;
                }

            private:
                const_pointer begin_;
                const_pointer end_;
            };

            container<std::uint8_t> data () const {
                auto begin = aligned_ptr<std::uint8_t> (this + 1);
                return {begin, begin + data_size_};
            }
            container<internal_fixup> ifixups () const {
                auto begin = aligned_ptr<internal_fixup> (data ().end ());
                return {begin, begin + num_ifixups_};
            }
            container<external_fixup> xfixups () const {
                auto begin = aligned_ptr<external_fixup> (ifixups ().end ());
                return {begin, begin + num_xfixups_};
            }

            ///@{
            /// \brief A group of member functions which return the number of bytes
            /// occupied by a fragment instance.

            /// \returns The number of bytes occupied by this fragment section.
            std::size_t size_bytes () const;

            /// \returns The number of bytes needed to accommodate a fragment section with
            /// the given number of data bytes and fixups.
            static std::size_t size_bytes (std::size_t data_size, std::size_t num_ifixups,
                                           std::size_t num_xfixups);

            template <typename DataRange, typename IFixupRange, typename XFixupRange>
            static std::size_t size_bytes (DataRange const & d, IFixupRange const & i,
                                           XFixupRange const & x);

            template <typename DataRange, typename IFixupRange, typename XFixupRange>
            static std::size_t
            size_bytes (sources<DataRange, IFixupRange, XFixupRange> const & src) {
                return size_bytes (src.data_range, src.ifixups_range, src.xfixups_range);
            }
            ///@}

        private:
            std::uint32_t num_ifixups_ = 0;
            std::uint32_t num_xfixups_ = 0;
            std::uint64_t data_size_ = 0;

            /// A helper function which returns the distance between two iterators,
            /// clamped to the maximum range of IntType.
            template <typename IntType, typename Iterator>
            static IntType set_size (Iterator first, Iterator last);

            /// Calculates the size of a region in the section including any necessary
            /// preceeding alignment bytes.
            /// \param pos  The starting offset within the section.
            /// \param num  The number of instance of type Ty.
            /// \returns Number of bytes occupied by the elements.
            template <typename Ty>
            static inline std::size_t part_size_bytes (std::size_t pos, std::size_t num) {
                if (num > 0) {
                    pos = aligned<Ty> (pos) + num * sizeof (Ty);
                }
                return pos;
            }
        };

        static_assert (std::is_standard_layout<section>::value,
                       "section must satisfy StandardLayoutType");

        /// A trivial class which exists solely to verify the layout of the section type
        /// (including its private member variables and is declared as a friend of it.
        struct section_check {
            static_assert (offsetof (section, num_ifixups_) == 0,
                           "num_ifixups_ offset differs from expected value");
            static_assert (offsetof (section, num_xfixups_) == 4,
                           "num_xfixups_ offset differs from expected value");
            static_assert (offsetof (section, data_size_) == 8,
                           "data_size_ offset differs from expected value");
            static_assert (sizeof (section) == 16, "section size does not match expected");
        };

        // (ctor)
        // ~~~~~~
        template <typename DataRange, typename IFixupRange, typename XFixupRange>
        section::section (DataRange const & d, IFixupRange const & i, XFixupRange const & x) {
            auto const start = reinterpret_cast<std::uint8_t *> (this);
            auto p = reinterpret_cast<std::uint8_t *> (this + 1);

            if (d.first != d.second) {
                p = std::copy (d.first, d.second, aligned_ptr<std::uint8_t> (p));
                data_size_ = section::set_size<decltype (data_size_)> (d.first, d.second);
            }
            if (i.first != i.second) {
                p = reinterpret_cast<std::uint8_t *> (
                    std::copy (i.first, i.second, aligned_ptr<internal_fixup> (p)));
                num_ifixups_ = section::set_size<decltype (num_ifixups_)> (i.first, i.second);
            }
            if (x.first != x.second) {
